
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ВКМ_ВыполненныеКлиентуРаботы 
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВКМ_Договор);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора) И 
	 		 ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора) И
			 	(Дата < ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора ИЛИ
					Дата > ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата документа выходит за рамки действия договора";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого ТекСтрокаСписокРабот Из ВКМ_ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Договор = ВКМ_Договор;
		Движение.Период = Дата;
		Движение.Клиент = ВКМ_Клиент;
		Движение.КоличествоЧасов = ТекСтрокаСписокРабот.ВКМ_ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаСписокРабот.ВКМ_ЧасыКОплатеКлиенту;
	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
КонецПроцедуры
